'''
вывод текста
выражения и операторы
переменные
условия
циклы
функции
последовательности
модули
ООП
'''

questions = [
    {
        'вопрос': 'как позицианировать элемент в tkinter?',
        'ответы': ['print', 'pack', 'prtnt', 'peck'],
        'индекс правильного ответа': 'pack',
        'теги': ('выражения и операторы'),
    },
    {
        'вопрос': 'как создать функцию?',
        'ответы': ['def', 'bef', 'while', 'while True'],
        'индекс правильного ответа': 'def',
        'теги': ('выражения и операторы'),
    },
    {
        'вопрос': 'Какой оператор складывает числа?',
        'ответы': ['+=', '+', '*', '-'],
        'индекс правильного ответа': '+',
        'теги': ('выражения и операторы'),
    },
    {
        'вопрос': 'Какой оператор умножает числа в Питоне?',
        'ответы': ['-', '+', '*', '**'],
        'индекс правильного ответа': '*',
        'теги': ('выражения и операторы'),
    },
    {
        'вопрос': 'Какой из этих типов изменяемый?',
        'ответы': ['list', 'str', 'tuple', 'int'],
        'индекс правильного ответа': 'list',
        'теги': ('последовательности')
    },
    {
        'вопрос': 'Как прекратить цикл?',
        'ответы': ['break', 'stop', 'ostanovit', 'brek'],
        'индекс правильного ответа': 'break',
        'теги': ('циклы')
    },
    {
        'вопрос': 'как создать условия?',
        'ответы': ['if', 'ilif', 'yslovie', 'ef'],
        'индекс правильного ответа': 'break',
        'теги': ('условия')
    },
    {
        'вопрос': 'Как создать бесконечный цикл?',
        'ответы': ['while', 'true While', 'yslovie', 'while True'],
        'индекс правильного ответа': 3,
        'теги': ('циклы')
    },
    {
        'вопрос': 'Как вывести в терминал текст?',
        'ответы': ['print', 'text', 'input', 'terminal pokaji text'],
        'индекс правильного ответа': 0,
        'теги': ('терминал')
    }]
